from pymol import cmd, cgo

cone = [
    cgo.CONE,
    0.0, 0.0, 0.0,      # 起点 (x1, y1, z1)
    0.0, 0.0, 100.0,      # 终点 (x2, y2, z2)
    0.5, 0.0,           # 起点半径=0.5, 终点半径=0.0 (尖端)
    0.0, 0.0, 1.0,      # 起点颜色：蓝色
    0.0, 0.0, 1.0,      # 终点颜色：蓝色
    1.0, 1.0,            # 起点和终点都封口
    
    cgo.CONE,
    0.0, 0.0, 0.0,      # 起点 (x1, y1, z1)
    0.0, 100.0, 0.0,      # 终点 (x2, y2, z2)
    0.5, 0.0,           # 起点半径=0.5, 终点半径=0.0 (尖端)
    1.0, 0.0, 0.0,      # 起点颜色：蓝色
    1.0, 0.0, 0.0,      # 终点颜色：蓝色
    1.0, 1.0            # 起点和终点都封口
]

cmd.load_cgo(cone, "my_cone")